app/views/questions/index.html.erb

SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN questions ON questions.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Question' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT questions.id FROM "questions" ORDER BY "questions"."created_at" DESC)) GROUP BY taggings.tag_id HAVING (COUNT(taggings.tag_id) > 0)) AS taggings ON taggings.tag_id = tags.id
---
	<p>
		Tags:<%=raw var.tag_list.map{|t| link_to t,tag_path(t)}.join(', ')%>