app/views/static_pages/home.html.erb

SELECT "questions".* FROM "questions" WHERE (user_id = 98) ORDER BY "questions"."created_at" DESC
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 98]]
---
			<span>
				<%= pluralize(current_user.questions.count, "Question") %>