app/views/users/show.html.erb

SELECT  1 AS one FROM "questions" WHERE "questions"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ? ORDER BY "questions"."created_at" DESC  [["user_id", 98]]
---
<div class = "col-md-8">
	<% if @user.questions.any? %>

INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Molestiae dolorum excepturi quae id vel non."], ["user_id", 100], ["created_at", 2016-11-10 21:14:37 UTC], ["updated_at", 2016-11-10 21:14:37 UTC]]
---
				<span class="timestamp">
				Posted <%= time_ago_in_words(question.created_at) %> ago.
				</span>