app/controllers/questions_controller.rb

INSERT INTO "questions" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "kjhkhkjhkhkhkljh"], ["user_id", 98], ["created_at", 2016-11-10 21:59:17 UTC], ["updated_at", 2016-11-10 21:59:17 UTC]]
---
	def create
		@question = current_user.questions.build(question_params)
		@questions = Question.all
		@following_users = current_user
		@user_questions = current_user.questions
		# if(@question.save)
		# 	flash[:success] = "Question Posted Sucssessfully"
		# 	redirect_to root_url
		# else
		# 	@feed_items = []
		# 	redirect_to root_url
		# end

		respond_to do |format|
			if(@question.save)

SELECT "questions".* FROM "questions" JOIN taggings questions_taggings_bf5afc1  ON questions_taggings_bf5afc1.taggable_id = questions.id AND questions_taggings_bf5afc1.taggable_type = 'Question' AND questions_taggings_bf5afc1.tag_id = 2 ORDER BY "questions"."created_at" DESC
SELECT tags.*, taggings.tags_count AS count FROM "tags" JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM "taggings" INNER JOIN questions ON questions.id = taggings.taggable_id WHERE (taggings.taggable_type = 'Question' AND taggings.context = 'tags') AND (taggings.taggable_id IN(SELECT questions.id FROM "questions" ORDER BY "questions"."created_at" DESC)) GROUP BY taggings.tag_id HAVING (COUNT(taggings.tag_id) > 0)) AS taggings ON taggings.tag_id = tags.id
---
	def index
		if params[:tag]
			@question=Question.tagged_with(params[:tag])
			@questions = Question.all
			@users = current_user
			@following_users = current_user
			@user_questions = current_user.questions
		else
			@question=Question.all