app/controllers/static_pages_controller.rb

  def home
  	if logged_in?
  		# @all_question = Question.all
  		@user = User.all
      @user_all = User.all
  		# debugger
      @users = User.find(current_user.id)
  		# @comm = @user.questions
  		@question = current_user.questions.build
  		@comment = current_user.comments.build
  		@feed_items = Question.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE (user_id = 98) ORDER BY "questions"."created_at" DESC