app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("name", "email", "city", "state", "institution", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @user=User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."created_at" DESC LIMIT ?  [["id", 103], ["LIMIT", 1]]

  def search
    #@users=User.search(params)
    @questions = current_user.questions
    @following_users = current_user
    @user_questions = current_user.questions
    @user_all = User.all
---
SELECT "users".* FROM "users" WHERE (name like '%jessica%' or email like '%jessica%') ORDER BY "users"."created_at" DESC

def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."created_at" DESC LIMIT ?  [["id", 103], ["LIMIT", 1]]
UPDATE "users" SET "city" = ?, "state" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["city", "los angeles"], ["state", "los angeles"], ["password_digest", "$2a$10$9PHA6Z4B91jeaAtiaiscQO7N42zKNHA12T/soLQBkbLTs0zHKpgGu"], ["updated_at", 2016-11-11 13:47:45 UTC], ["id", 103]]